package modules

import "strings"


// Получает квадрат QRA, возвращает широту и долготу в градусах
func QraToLatLong(qra string) (float64, float64) {

	var lat float64  // Широта в градусах
	var long float64 // Долгота в градусах

	// Мапы для широты
	latMap1 := map[string]float64 {
		"A": -90, "B": -80, "C": -70, "D": -60, "E": -50, "F": -40, "G": -30, "H": -20, "I": -10,
		"J": 0, "K": 10, "L": 20, "M": 30, "N": 40, "O": 50, "P": 60, "Q": 70, "R": 80,
	}
	latMap2 := map[string]float64 {
		"0": 0, "1": 1, "2": 2, "3": 3, "4": 4, "5": 5, "6": 6, "7": 7, "8": 8, "9": 9,
	}
	latMap3 := map[string]float64 {
		"A": 0.0208, "B": 0.0625, "C": 0.1042, "D": 0.1458, "E": 0.1875, "F": 0.2292, "G": 0.2708, "H": 0.3125,
		"I": 0.3542, "J": 0.3958, "K": 0.4375, "L": 0.4792,	"M": 0.5208, "N": 0.5625, "O": 0.6042, "P": 0.6458,
		"Q": 0.6875, "R": 0.7292, "S": 0.7708, "T": 0.8125, "U": 0.8542, "V": 0.8958, "W": 0.9375, "X": 0.9792,
	}

	// Мапы для долготы
	longMap1 := map[string]float64 {
		"A": -180, "B": -160, "C": -140, "D": -120, "E": -100, "F": -80, "G": -60, "H": -40, "I": -20,
		"J": 0, "K": 20, "L": 40, "M": 60, "N": 80, "O": 100, "P": 120, "Q": 140, "R": 160,
	}
	longMap2 := map[string]float64 {
		"0": 0, "1": 2, "2": 4, "3": 6, "4": 8, "5": 10, "6": 12, "7": 14, "8": 16, "9": 18,
	}
	longMap3 := map[string]float64 {
		"A": 0.0417, "B": 0.1250, "C": 0.2083, "D": 0.2917, "E": 0.3750, "F": 0.4583, "G": 0.5417, "H": 0.6250,
		"I": 0.7083, "J": 0.7917, "K": 0.8750, "L": 0.9583,	"M": 1.0417, "N": 1.1250, "O": 1.2083, "P": 1.2917,
		"Q": 1.3750, "R": 1.4583, "S": 1.5417, "T": 1.6250, "U": 1.7083, "V": 1.7917, "W": 1.8750, "X": 1.9583,
	}

	lat = latMap1[strings.ToUpper(qra[1:2])] + latMap2[qra[3:4]] + latMap3[strings.ToUpper(qra[5:6])]
	long = longMap1[strings.ToUpper(qra[0:1])] + longMap2[qra[2:3]] + longMap3[strings.ToUpper(qra[4:5])]

	return lat, long
}
